export type Rarity = 'C' | 'R' | 'SR' | 'UR';

export const termRarities: Record<string, Rarity> = {
  // 1-a
  "データ": "C", "情報": "C", "情報処理": "C", "情報通信技術（ICT）": "R", "高度情報通信社会": "R",
  "情報システム": "R", "サーバ": "R", "データベース": "R", "ビッグデータ": "SR", "クラウドコンピューティング": "SR",
  "機械学習": "SR", "人工知能（AI）": "UR", "データマイニング": "SR", "バーコード": "C", "非接触型 IC": "R",
  "GPS": "R", "インターネットバンキング": "R", "オンラインショッピング": "C", "電子発注システム（EOS）": "SR",
  "電子商取引（EC）": "R", "仮想現実（VR）": "R", "拡張現実（AR）": "R", "複合現実（MR）": "SR", "IoT": "SR", "SNS": "C",
  
  // 1-b
  "メディアの特性": "R", "ユーザインタフェース": "SR", "ユニバーサルデザイン": "R", "ユーザビリティ": "R",
  "アクセシビリティ": "R", "ピクトグラム": "C", "可読性": "R", "視認性": "R", "判読性": "R", "フォント": "C",
  "ポイント": "C", "色相": "C", "明度": "C", "彩度": "C", "色彩": "C", "色相環": "R", "補色": "R",
  "ドット": "C", "画素": "C", "dpi": "R", "ppi": "R", "光の三原色": "R", "色の三原色": "R",

  // 1-c
  "情報モラル": "C", "フィッシング詐欺": "R", "ワンクリック詐欺": "R", "有害サイト": "C", "ユーザ ID": "C",
  "パスワード": "C", "なりすまし": "R", "不正アクセス禁止法": "SR", "プライバシー": "R", "肖像権": "R",
  "個人情報保護法": "SR", "個人識別符号": "SR", "オプトイン": "R", "オプトアウト": "R", "知的財産権": "SR",
  "著作権": "SR", "著作権法": "SR", "クリエイティブ・コモンズ": "R",

  // 2-a
  "ハードウェア": "C", "五大装置": "SR", "入力装置": "C", "制御装置": "C", "記憶装置": "C", "演算装置": "C",
  "出力装置": "C", "中央処理装置（CPU）": "UR", "主記憶装置": "R", "補助記憶装置": "R", "HDD": "R", "SSD": "R",
  "光学ドライブ": "C", "USB メモリ": "C", "SD メモリカード": "C", "解像度": "R", "デジタルカメラ": "C",
  "スマートデバイス": "C", "インタフェース": "R", "RFID": "SR", "Bluetooth": "R", "HDMI": "R", "USB": "C",
  "集積回路（IC）": "SR", "RAM": "R", "ROM": "R", "ビデオボード": "R", "VRAM": "R", "フラッシュメモリ": "R",
  "デジタル": "C", "アナログ": "C", "ビット": "C", "バイト": "C", "2進数": "R", "基数変換": "SR",
  "ms": "C", "μs": "C", "ns": "C", "ps": "C", "fs": "C", "KB": "C", "MB": "C", "GB": "C", "TB": "C", "PB": "C",
  "標本化": "SR", "量子化": "SR", "符号化": "SR", "ソフトウェア": "C", "アイコン": "C",
  "オペレーティングシステム（OS）": "UR", "アプリケーションソフトウェア": "C", "アンインストール": "C",
  "インストール": "C", "オープンソースソフトウェア（OSS）": "SR", "フリーウェア": "C", "シェアウェア": "C",
  "サイトライセンス": "R", "デバイスドライバ": "R", "バグ": "C", "パッチ": "R", "ファイル": "C", "ファイル名": "C",
  "テキストファイル": "C", "バイナリファイル": "R", "フォーマット": "R", "フォルダ": "C", "拡張子": "C",

  // 2-b
  "情報通信ネットワーク": "C", "データ通信": "C", "アナログ回線": "R", "デジタル回線": "R", "LAN": "R",
  "無線 LAN": "R", "有線 LAN": "R", "WAN": "R", "光ファイバ": "SR", "Wi-Fi": "R", "アクセスポイント": "R",
  "インターネット": "C", "WWW": "C", "プロバイダ": "R", "サーバ名": "R", "ドメイン名": "R", "IP アドレス": "SR",
  "DNS": "SR", "Web ページ": "C", "ブラウザ": "C", "URL": "C", "Web サーバ": "R", "ハイパーリンク": "C",
  "HTML": "R", "電子メール": "C", "HTML メール": "C", "Web メール": "C", "メールサーバ": "R",
  "メールボックス": "R", "プロトコル": "SR",

  // 2-c
  "アップロード": "C", "ダウンロード": "C", "検索エンジン": "C", "コンテンツフィルタリング": "R",
  "ブラックリスト方式": "R", "ホワイトリスト方式": "R", "メーリングリスト": "C", "TO": "C", "CC": "C", "BCC": "C",
  "添付ファイル": "C", "圧縮": "R", "解凍": "R",

  // 2-d
  "サイバー攻撃": "R", "マルウェア": "SR", "コンピュータウイルス": "SR", "セキュリティホール": "SR",
  "インシデント": "R", "迷惑メール": "C", "スパムメール": "C", "スパイウェア": "R", "トロイの木馬": "R",
  "ワーム": "R", "ランサムウェア": "SR", "アドウェア": "R", "情報セキュリティ": "SR", "機密性": "SR",
  "完全性": "SR", "可用性": "SR", "バックアップ": "R", "ウイルス対策ソフトウェア": "R", "パターンファイル": "R",
  "アップデート": "C", "セキュリティパッチ": "R", "認証": "SR", "ログイン": "C", "ログアウト": "C",
  "ワンタイムパスワード": "SR", "アクセス権": "R", "暗号化": "UR", "復号": "SR", "暗号文": "R",

  // 3-a
  "統計分析": "R", "量的データ": "R", "質的データ": "R", "尺度水準": "SR", "全数調査": "R", "標本調査": "R",
  "母集団": "R", "標本": "R", "標本誤差": "SR", "外れ値": "R", "欠損値": "R", "代表値": "SR", "偏差": "R",
  "分散": "SR", "標準偏差": "SR", "度数分布表": "R", "ヒストグラム": "R", "箱ひげ図": "SR", "散布図": "R",
  "相関": "SR", "ABC 分析": "SR", "パレート図": "SR", "時系列分析": "R",

  // 3-b
  "棒グラフ": "C", "円グラフ": "C", "折れ線グラフ": "C", "複合グラフ": "R", "レーダーチャート": "R", "Ｚグラフ": "SR",

  // 3-c
  "ロジカルシンキング": "R", "ロジックツリー": "R", "MECE": "SR", "デシジョンテーブル": "SR", "ガントチャート": "R",
  "SWOT 分析": "SR", "特性要因図": "SR", "PDCA": "R", "ブレーンストーミング": "R", "KJ 法": "SR", "PPM 分析": "SR",
  "シミュレーション": "SR", "モデル化": "R", "動的モデル": "R", "静的モデル": "R", "確定的モデル": "R",
  "確率的モデル": "R", "モンテカルロ法": "SR", "アルゴリズム": "UR", "プログラム": "SR", "プログラム言語": "SR",
  "プログラミング": "SR", "順次構造": "R", "選択構造": "R", "繰り返し構造": "R", "トレース": "SR", "流れ図": "SR"
};
